Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.SetOptions Method (List<KeyValuePair<Int32, String>>)
 Sets the value options of an integer property. The maximum count of options is 400.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool SetOptions(
	List<KeyValuePair<int, string>> IntOptions
)
Public Function SetOptions (
	IntOptions As List(Of KeyValuePair(Of Integer, String))
) As Boolean
Parameters
IntOptions
Type: System.Collections.Generic.List<KeyValuePair<Int32, String>>
The value options.
Return Value
Type: Boolean
True on success.
See Also
Reference
UserPropertyItem Class
SetOptions Overload
Tekla.Structures.Catalogs Namespace